Tekla Open API Reference for Tekla Structures 2025
PolycurveGeometryBuilder.Prepend Method (Arc)
 Prepends an arc to the geometry list
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PolycurveGeometryBuilder Prepend(
	Arc arc
)
Public Function Prepend (
	arc As Arc
) As PolycurveGeometryBuilder
Parameters
arc
Type: Tekla.Structures.Geometry3d.Arc
Geometry to prepend
Return Value
Type: PolycurveGeometryBuilder
The builder itself
See Also
Reference
PolycurveGeometryBuilder Class
Prepend Overload
Tekla.Structures.Geometry3d Namespace